In [1]:
import pandas as pd
import numpy as np

In [2]:
path = "C:/Users/avnip/Downloads/"
file = "titanic.csv"
df = pd.read_csv(path+file)
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [3]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket','Cabin', 'Embarked'],axis='columns',inplace=True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [7]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [8]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [13]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [16]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [17]:
len(X_train)

623

In [18]:
len(X_test)

268

In [19]:
len(inputs)

891

# Naive bayes model using GaussianNB

In [20]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [21]:
model.fit(X_train, y_train)

GaussianNB()

In [22]:
model.score(X_test, y_test)

0.7723880597014925

In [23]:
#will take the 1st 10 samples
X_test[:10]

     Pclass        Age     Fare  female  male
41        2  27.000000  21.0000       1     0
564       3  29.699118   8.0500       1     0
399       2  28.000000  12.6500       1     0
762       3  20.000000   7.2292       0     1
623       3  21.000000   7.8542       0     1
628       3  26.000000   7.8958       0     1
218       1  32.000000  76.2917       1     0
601       3  29.699118   7.8958       0     1
792       3  29.699118  69.5500       1     0
735       3  28.500000  16.1000       0     1

In [24]:
y_test[:10]

41     0
564    0
399    1
762    1
623    0
628    0
218    1
601    0
792    0
735    0
Name: Survived, dtype: int64

In [25]:
model.predict(X_test[:10])

array([1, 1, 1, 0, 0, 0, 1, 0, 1, 0], dtype=int64)

In [27]:
model.predict_proba(X_test[:10])

array([[0.02448514, 0.97551486],
       [0.05823997, 0.94176003],
       [0.02496501, 0.97503499],
       [0.99048355, 0.00951645],
       [0.99072561, 0.00927439],
       [0.991485  , 0.008515  ],
       [0.00153471, 0.99846529],
       [0.99179586, 0.00820414],
       [0.01919928, 0.98080072],
       [0.99190065, 0.00809935]])